
&НаСервере
Процедура ВыгрузкаДанных(Команда) 
	ИсточникНаименование = ИсточникСправочник.Наименование;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	&НаименованиеСправочника.Наименование КАК Наименование
	|ИЗ
	|	Справочник.&НаименованиеСправочника КАК Контрагенты";
	
	Запрос.УстановитьПараметр("НаименованиеСправочника", ИсточникНаименование);
	
	Результат = Запрос.Выполнить(); 
	
	Список = СписокДанных.Значение;
	Список.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Наименование"));
КонецПроцедуры
