&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗаголовков = Параметры.Заголовки;
	
	МассивЗаголовков = СписокЗаголовков.ВыгрузитьЗначения();	
	
	КолЗаг = МассивЗаголовков.Количество();
	
	Для Ячейка = 1 По КолЗаг Цикл
		ВыделОбл = Данные.Область("R1C" + Строка(Ячейка));
		ВыделОбл.Текст = МассивЗаголовков.Получить(Ячейка - 1);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	АдресВХ = Формирование();
	ВладелецФормы.ОбработатьПодбор(АдресВХ);
	Закрыть();
КонецПроцедуры

&НаСервере
Функция Формирование()	
	
	КолКолоннок = Данные.ШиринаТаблицы;
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Данные.Область());
	Построитель.Выполнить();
	
	ТаблицаЗнач = Новый ТаблицаЗначений;
	ТаблицаЗнач = Построитель.Результат.Выгрузить();
	ТаблицаЗначОбработанный = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗнач);
	
	АдресВХ = ПоместитьВоВременноеХранилище(ТаблицаЗначОбработанный, Новый УникальныйИдентификатор);
	
	Возврат АдресВХ
КонецФункции
